eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовДоговоров/абс_ИзменениеСтатусовДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовДоговоров</name>
  <comment>54270</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДоговора</name>
    <type>
      <types>EnumRef.абсСтатусыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/WebServices/abs_AgentScheme/Module.bsl
Функция ObnovitAktAgenta(Number, Date, Data, UIN)

	ОбработчикWebService = абс_WebService.ПолучитьОбработчикWebService(); 
	
	Попытка 
		// Вызов обработчика
		ОтветXDTO = ОбработчикWebService.ObnovitAktAgenta(Number, Date, Data, UIN);				
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		абс_WebService.СообщитьОбОшибке(ОписаниеОшибки, "Вызов обработчика ObnovitAktAgenta()");
		
		ОтветXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.abs-soft.ru/AgentScheme", "Rezult"));
		ОтветXDTO.Rez = Ложь;
		ОтветXDTO.Error = "Вызов обработчика ObnovitAktAgenta(): " + ОписаниеОшибки;
		
	КонецПопытки;
	
	Возврат ОтветXDTO;
	
КонецФункции

Функция GetDogovorData(Code)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВалютаВзаиморасчетов) КАК ВалютаВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВедениеВзаиморасчетов) КАК ВедениеВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВидВзаиморасчетов) КАК ВидВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВидУсловийДоговора) КАК ВидУсловийДоговора,
	|	ДоговорыКонтрагентов.ДержатьРезервБезОплатыОграниченноеВремя,
	|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности,
	|	ДоговорыКонтрагентов.ДопустимоеЧислоДнейЗадолженности,
	|	ДоговорыКонтрагентов.Комментарий,
	|	ДоговорыКонтрагентов.КонтролироватьСуммуЗадолженности,
	|	ДоговорыКонтрагентов.КонтролироватьЧислоДнейЗадолженности,
	|	ДоговорыКонтрагентов.ОбособленныйУчетТоваровПоЗаказамПокупателей,
	|	ДоговорыКонтрагентов.ПроцентКомиссионногоВознаграждения,
	|	ДоговорыКонтрагентов.ПроцентПредоплаты,
	|	ДоговорыКонтрагентов.СпособРасчетаКомиссионногоВознаграждения,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ТипЦен) КАК ТипЦен,
	|	ДоговорыКонтрагентов.ЧислоДнейРезерваБезОплаты,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВидДоговора) КАК ВидДоговора,
	|	ДоговорыКонтрагентов.УчетАгентскогоНДС,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВидАгентскогоДоговора) КАК ВидАгентскогоДоговора,
	|	ДоговорыКонтрагентов.КонтролироватьДенежныеСредстваКомитента,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.Дата,
	|	ДоговорыКонтрагентов.Номер,
	|	ДоговорыКонтрагентов.РеализацияНаЭкспорт,
	|	ДоговорыКонтрагентов.ВестиПоДокументамРасчетовСКонтрагентом,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ОсновнойПроект) КАК ОсновнойПроект,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ОсновнаяСтатьяДвиженияДенежныхСредств) КАК ОсновнаяСтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.СрокДействия,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ПорядокРегистрацииСчетовФактурНаАвансПоДоговору) КАК ПорядокРегистрацииСчетовФактурНаАвансПоДоговору,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.НаименованиеДляСчетаФактурыНаАванс) КАК НаименованиеДляСчетаФактурыНаАванс,
	|	ДоговорыКонтрагентов.НалоговыйАгентПоОплате,
	|	ДоговорыКонтрагентов.абс_ЛицевойСчетБиллинга,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_СтатусДоговора) КАК абс_СтатусДоговора,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_СтатусДоговораСтарый) КАК абс_СтатусДоговораСтарый,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_СтатусДоговораДляДирКСП) КАК абс_СтатусДоговораДляДирКСП,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ВидДоговора) КАК абс_ВидДоговора,
	|	ДоговорыКонтрагентов.абс_ПредметДоговораСодержание,
	|	ДоговорыКонтрагентов.абс_ДатаРегистрацииДоговора,
	|	ДоговорыКонтрагентов.абс_СуммаБезНДС,
	|	ДоговорыКонтрагентов.абс_СуммаНДС,
	|	ДоговорыКонтрагентов.абс_СуммаСНДС,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_СтавкаНДС) КАК абс_СтавкаНДС,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_Ответственный) КАК абс_Ответственный,
	|	ДоговорыКонтрагентов.абс_ДатаНачалаДействия,
	|	ДоговорыКонтрагентов.абс_Конфиденциальный,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ТипДоговора) КАК абс_ТипДоговора,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ЛьготаПоНДС) КАК абс_ЛьготаПоНДС,
	|	ДоговорыКонтрагентов.абс_РегНомер,
	|	ДоговорыКонтрагентов.абс_ДанныеОТендере,
	|	ДоговорыКонтрагентов.абс_БезЗакупочногоЗаказа,
	|	ДоговорыКонтрагентов.абс_ПричинаИзмененияСтатуса,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_СотрудникДопСогласование) КАК абс_СотрудникДопСогласование,
	|	ДоговорыКонтрагентов.абс_ДоговорБезСуммы,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ОтветственныйПД) КАК абс_ОтветственныйПД,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ТипСоглашенияОКонфиденциальности) КАК абс_ТипСоглашенияОКонфиденциальности,
	|	ДоговорыКонтрагентов.абс_ТиповойДоговор,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ВидДеятельности) КАК абс_ВидДеятельности,
	|	ДоговорыКонтрагентов.абс_ЕстьОригиналДоговора,
	|	ДоговорыКонтрагентов.абс_ЕжемесячнаяСуммаБезНДС,
	|	ДоговорыКонтрагентов.абс_ЕжемесячнаяСуммаНДС,
	|	ДоговорыКонтрагентов.абс_ЕжемесячнаяСуммаСНДС,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ЕжемесячнаяСтавкаНДС) КАК абс_ЕжемесячнаяСтавкаНДС,
	|	ДоговорыКонтрагентов.абс_Подключения,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ОсновнойДоговор) КАК абс_ОсновнойДоговор,
	|	ДоговорыКонтрагентов.абс_УслугаМГМН,
	|	ДоговорыКонтрагентов.абс_ЧислоДнейПросрочки,
	|	ДоговорыКонтрагентов.абс_ПроцентПеней,
	|	ДоговорыКонтрагентов.абс_УИЛ_ДЗО,
	|	ДоговорыКонтрагентов.абс_КлиентБиллинга,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_Оператор) КАК абс_Оператор,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ДЗО) КАК абс_ДЗО,
	|	ДоговорыКонтрагентов.абс_СтоимостьАктивовОбщества,
	|	ДоговорыКонтрагентов.абс_КредитныйДоговорНаКВ,
	|	ДоговорыКонтрагентов.абс_Инвестиционный,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_Агент) КАК абс_Агент,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ВстречныйДоговор) КАК абс_ВстречныйДоговор,
	|	ДоговорыКонтрагентов.абс_ПроцентРезерваПоДоговору,
	|	ДоговорыКонтрагентов.абс_ПроцентАвансаПоДоговору,
	|	ДоговорыКонтрагентов.абс_ПлановаяДатаРезерваПоДоговору,
	|	ДоговорыКонтрагентов.абс_КурсАвансаРезерва,
	|	ДоговорыКонтрагентов.абс_КоличествоДнейАнализаАванса,
	|	ДоговорыКонтрагентов.абс_ОтсрочкаАвансаПоРабочимДням,
	|	ДоговорыКонтрагентов.абс_ДоходныйДоговор,
	//АБС ИЗМЕНЕНИЕ 45834  22.08.2014 15:55:59  Шамов
	//|	ДоговорыКонтрагентов.абс_БезРезерва,
	|	ДоговорыКонтрагентов.абс_ПредусмотренРезерв,	
	//АБС ИЗМЕНЕНИЕ 45834 КОНЕЦ
	|	ДоговорыКонтрагентов.абс_БезДоходногоДоговора,
	|	ДоговорыКонтрагентов.абс_КоличествоДнейОтсрочкиПлатежа,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_СтатьяДвиженияДенежныхСредств) КАК абс_СтатьяДвиженияДенежныхСредств,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ПрименяемаяМетодикаДляТрансфертногоЦенообразования) КАК абс_ПрименяемаяМетодикаДляТрансфертногоЦенообразования,
	|	ДоговорыКонтрагентов.абс_АвтоматическиСоздаватьДоговораСФилиалами,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_ОснованиеДоговорСКТТК) КАК абс_ОснованиеДоговорСКТТК,
	|	ДоговорыКонтрагентов.абс_ИнвестиционныйНМА,
	|	ДоговорыКонтрагентов.абс_НеОблагаемыйНДС,
	|	ДоговорыКонтрагентов.абс_Кураторы.(
	|		НомерСтроки,
	|		ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_Кураторы.Куратор) КАК Куратор
	|	),
	|	ДоговорыКонтрагентов.абс_Филиалы.(
	|		НомерСтроки,
	|		ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_Филиалы.Филиал) КАК Филиал,
	|		ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.абс_Филиалы.ДоговорФилиала) КАК ДоговорФилиала
	|	)
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Код = &Код");
	
	Запрос.УстановитьПараметр("Код", Code);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Если ТЗ.Количество() = 0 Тогда 
		Возврат "Договор с кодом " + Code + " не найден!";
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	
	Для Каждого КолонкаТЗ Из ТЗ.Колонки Цикл
		Если КолонкаТЗ.Имя = "Ссылка" Тогда 
			Продолжить;
		КонецЕсли;
		СтруктураДанных.Вставить(КолонкаТЗ.Имя, ТЗ[0][КолонкаТЗ.Имя]);
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ИзменениеСтатусовДоговоров.Период,
	|	ПРЕДСТАВЛЕНИЕ(абс_ИзменениеСтатусовДоговоров.СтатусДоговора) КАК СтатусДоговора,
	|	ПРЕДСТАВЛЕНИЕ(абс_ИзменениеСтатусовДоговоров.Исполнитель) КАК Исполнитель,
	|	абс_ИзменениеСтатусовДоговоров.Комментарий,
	|	абс_ИзменениеСтатусовДоговоров.ВнутреннийНомер
	|ИЗ
	|	РегистрСведений.абс_ИзменениеСтатусовДоговоров КАК абс_ИзменениеСтатусовДоговоров
	|ГДЕ
	|	абс_ИзменениеСтатусовДоговоров.Договор = &Договор";
	Запрос.УстановитьПараметр("Договор", ТЗ[0].Ссылка);
	
	СтруктураДанных.Вставить("ИсторияСтатусов", Запрос.Выполнить().Выгрузить());
	
	Возврат ЗначениеВСтрокуВнутр(СтруктураДанных);
	
КонецФункции
